#Область ПрограммныйИнтерфейс

// Добавляет команды действий в переданный список команд
// 
// Параметры:
//  КомандыДействий - Список - Список, в который добавляются команды действий.
Процедура ДобавитьКомандыДействий(КомандыДействий) Экспорт

	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Сортировка методов";
	НоваяСтрока.Идентификатор = "СортировкаМетодов";
	НоваяСтрока.ОбластьДействия = "Модуль";
	НоваяСтрока.Порядок = 700;
	НоваяСтрока.СпособЗапускаДействия = "ВызовМетодаМодуляМенеджера";

КонецПроцедуры // ДобавитьКомандыДействий()

// Выполняет действие на основании идентификатора команды.
// 
// Параметры:
//  ИдКоманды        - Строка    - Идентификатор команды для выполнения действия.
//  ПараметрыКоманды - Структура - Параметры команды, включает ДеревоСтруктурыМодулей.
Процедура ВыполнитьДействие(ИдКоманды, ПараметрыКоманды) Экспорт

	Если ИдКоманды = "СортировкаМетодов" Тогда
	КонецЕсли;

КонецПроцедуры // ВыполнитьДействие()

#КонецОбласти

