#Область ПрограммныйИнтерфейс

// Добавляет команды действий в переданный список команд
// 
// Параметры:
//  КомандыДействий - Список - Список, в который добавляются команды действий.
Процедура ДобавитьКомандыДействий(КомандыДействий) Экспорт

	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Вставка завершающего комментария";
	НоваяСтрока.Идентификатор = "ВставкаЗавершающихКомментариев";
	НоваяСтрока.Порядок = 600;
	НоваяСтрока.СпособЗапускаДействия = "ВызовМетодаМодуляМенеджера";

КонецПроцедуры // ДобавитьКомандыДействий()

// Выполняет действие на основании идентификатора команды.
// 
// Параметры:
//  ИдКоманды        - Строка    - Идентификатор команды для выполнения действия.
//  ПараметрыКоманды - Структура - Параметры команды, включает ДеревоСтруктурыМодулей.
Процедура ВыполнитьДействие(ИдКоманды, ПараметрыКоманды) Экспорт

	Если ИдКоманды = "ВставкаЗавершающихКомментариев" Тогда
		Методы = Обработки.ОМ_ОформляторМодулей.НайтиПодчиненныеСтроки(
			ПараметрыКоманды.ДеревоСтруктурыМодулей,
			"Процедура,Функция");
		Для каждого СтрокаДереваСтруктуры Из Методы Цикл
			СтрокаДереваСтруктуры.Содержимое.КомментарийОднострочныйКонец =
				СтрокаДереваСтруктуры.Содержимое.Имя + "()";
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ВыполнитьДействие()

#КонецОбласти

