#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыДействий(КомандыДействий) Экспорт
	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Установка инструкций препроцессора";
	НоваяСтрока.Идентификатор = "УстановкаИнструкцийПрепроцессора";
	НоваяСтрока.Порядок = 500;
	НоваяСтрока.СпособЗапускаДействия = "ВызовМетодаМодуляМенеджера";
КонецПроцедуры

Процедура ВыполнитьДействие(ИдКоманды, ПараметрыКоманды) Экспорт
	УстановитьИнструкцииПрепроцессораДляМодуляМенеджера(ПараметрыКоманды.ДеревоСтруктурыМодулей);
КонецПроцедуры

Процедура УстановитьИнструкцииПрепроцессораДляМодуляМенеджера(ДеревоСтруктуры) Экспорт
	ОбработкаУстановкиИнструкций().УстановитьИнструкцииПрепроцессораДляМодуляМенеджера(ДеревоСтруктуры);
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработкаУстановкиИнструкций()
	Возврат Обработки.ОМ_Компонент_УстановкаИнструкцийПрепроцессора.Создать();
КонецФункции

#КонецОбласти
