
#Область ПрограммныйИнтерфейс

Функция Обработать(ДеревоСтруктуры) Экспорт
	УстановитьИнструкцииПрепроцессораДляМодуляМенеджера(ДеревоСтруктуры);

	Возврат ДеревоСтруктуры;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьИнструкцииПрепроцессораДляМодуляМенеджера(ДеревоСтруктуры)
	Для каждого СтрМодуль Из ДеревоСтруктуры.Строки Цикл
		
		Если СтрМодуль.Содержимое.Свойство("ИнструкцииПрепроцессора") Тогда
			СтрМодуль.Содержимое.ИнструкцииПрепроцессора = ИнструкцииПрепроцессораДляМодуляМенеджера();
		КонецЕсли; 
		
		УстановитьИнструкцииПрепроцессораДляМодуляМенеджера(СтрМодуль);
		
	КонецЦикла;
КонецПроцедуры

Функция ИнструкцииПрепроцессораДляМодуляМенеджера()
	Возврат Новый Структура(
		"Клиент,Сервер,ТонкийКлиент,ВебКлиент,
		|МобильныйАвтономныйСервер,МобильноеПриложениеКлиент,МобильноеПриложениеСервер,МобильныйКлиент,
		|ТолстыйКлиентОбычноеПриложение,ТолстыйКлиентУправляемоеПриложение,
		|ВнешнееСоединение", //НаКлиенте,НаСервере
		Ложь, Истина, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Истина, Ложь, Истина);
КонецФункции

#КонецОбласти
