#Область ПрограммныйИнтерфейс

Функция СоответствиеТекстыМодулей(ДеревоСтруктуры) Экспорт
	
	ПроверитьИнструкцииПрепроцессораПоДеревуСтруктуры(ДеревоСтруктуры);
	
	СоотвМодулей = Новый Соответствие;
	
	Для каждого СтрМодуль Из ДеревоСтруктуры.Строки Цикл
		ТекстМодуля = ТекстМодуля(СтрМодуль);
		СоотвМодулей.Вставить(СтрМодуль, ТекстМодуля);
	КонецЦикла;
	
	Возврат СоотвМодулей;
КонецФункции

Функция ТекстМодуля(СтрЭлементМодуль) Экспорт
	Возврат ОбработкаГенерацииТекста().ГенерироватьТекстЭлементаРек(СтрЭлементМодуль, ТекущиеИнструкцииПрепроцессораМодуля);
КонецФункции

Функция ГенерироватьТекстМетода(СтрЭлементМетод, ВключатьКод = Истина, ВключатьДокументацию = Истина, ТолькоСигнатура = Ложь) Экспорт
	Возврат ОбработкаГенерацииТекста().МетодТекст(СтрЭлементМетод, ВключатьКод, ВключатьДокументацию, ТолькоСигнатура);
КонецФункции

#КонецОбласти

Функция ОбработкаГенерацииТекста()
	Возврат Обработки.ОМ_Компонент_ГенерацияТекстовМодулей.Создать();
КонецФункции
