#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АдресДереваСтруктурыМодулей") Тогда
		АдресДереваСтруктурыМодулей = Параметры.АдресДереваСтруктурыМодулей;
	Иначе
		ВызватьИсключение "В форму должен быть передан параметр ДеревоСтруктурыМодулей";
	КонецЕсли;
	
	ВариантВстроенногоЯзыка = "Русский";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Распределить(Команда)
	АдресНовогоДереваСтруктуры = РаспределитьНаСервере();
	Закрыть(АдресНовогоДереваСтруктуры);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РаспределитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.АнглийскийВариантВстроенногоЯзыка = (ВариантВстроенногоЯзыка = "Английский");
	
	дз = ПолучитьИзВременногоХранилища(АдресДереваСтруктурыМодулей);
	НовоеДеревоСтруктурыМодуля = ОбработкаОбъект.ДеревоСтруктурыМодулейСоСтандартнымиОбластями(дз);
	
	Возврат ПоместитьВоВременноеХранилище(НовоеДеревоСтруктурыМодуля);
КонецФункции

&НаСервере
Процедура ОпределитьВариантВстроенногоЯзыка()
	ВариантВстроенногоЯзыка = "Русский";
КонецПроцедуры

#КонецОбласти

