#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыДействий(КомандыДействий) Экспорт
	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Оформление тела методов (с настройкой)...";
	НоваяСтрока.Идентификатор = "ОформлениеМетодаСНастройкой";
	НоваяСтрока.ОбластьДействия = "Процедура,Функция,Модуль,Область";
	НоваяСтрока.Порядок = 203;
	НоваяСтрока.СпособЗапускаДействия = "ОткрытиеФормы";
КонецПроцедуры

Функция Оформить(Текст, _АнглСинтаксис = Ложь) Экспорт
	Компонент_ОформлениеТелаМетодов = Обработки.ОМ_Компонент_ОформлениеТелаМетодов.Создать();
	Возврат Компонент_ОформлениеТелаМетодов.Оформить(Текст);
КонецФункции

#КонецОбласти

