#Область ПрограммныйИнтерфейс

Функция ДеревоСтруктурыМодулейСоСтандартнымиОбластями(ДеревоСтруктуры) Экспорт
	Возврат ОбработкаРасстановкиОбластей().ДеревоСтруктурыМодулейСоСтандартнымиОбластями(ДеревоСтруктуры);
КонецФункции

Функция ДобавитьМодульСоСтандартнымиОбластями(СтрМодуль, НовоеДеревоСтруктуры) Экспорт
	Возврат ОбработкаРасстановкиОбластей().ДобавитьМодульСоСтандартнымиОбластями(СтрМодуль, НовоеДеревоСтруктуры);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработкаРасстановкиОбластей()
	Возврат Обработки.ОМ_Компонент_РасстановкаОбластей.Создать();
КонецФункции

#КонецОбласти

