#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыДействий(КомандыДействий) Экспорт
	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Расстановка областей";
	НоваяСтрока.Идентификатор = "РасстановкаОбластей";
	НоваяСтрока.Порядок = 100;
	НоваяСтрока.СпособЗапускаДействия = "ВызовМетодаМодуляМенеджера";

	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Расстановка областей";
	НоваяСтрока.Идентификатор = "РасстановкаОбластейВыбранногоМодуля";
	НоваяСтрока.ОбластьДействия = "Модуль";
	НоваяСтрока.Порядок = 100;
	НоваяСтрока.СпособЗапускаДействия = "ВызовМетодаМодуляМенеджера";
КонецПроцедуры

Процедура ВыполнитьДействие(ИдКоманды, ПараметрыКоманды) Экспорт
	Если ИдКоманды = "РасстановкаОбластей" Тогда
		ПараметрыКоманды.ДеревоСтруктурыМодулей = ДеревоСтруктурыМодулейСоСтандартнымиОбластями(ПараметрыКоманды.ДеревоСтруктурыМодулей);
	ИначеЕсли ИдКоманды = "РасстановкаОбластейВыбранногоМодуля" Тогда
		Для Индекс = 0 По ПараметрыКоманды.ДеревоСтруктурыМодулей.Строки.Количество() - 1 Цикл
			СтрокаДерева = ПараметрыКоманды.ДеревоСтруктурыМодулей.Строки[Индекс];
			Если СтрокаДерева.Выбрана Тогда
				НоваяСтрока = ПараметрыКоманды.ДеревоСтруктурыМодулей.Строки.Вставить(Индекс);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);

				ЗаполнитьМодульСоСтандартнымиОбластями(СтрокаДерева, НоваяСтрока);
				
				ПараметрыКоманды.ДеревоСтруктурыМодулей.Строки.Удалить(Индекс + 1);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ДеревоСтруктурыМодулейСоСтандартнымиОбластями(ДеревоСтруктуры) Экспорт
	Возврат ОбработкаРасстановкиОбластей().ДеревоСтруктурыМодулейСоСтандартнымиОбластями(ДеревоСтруктуры);
КонецФункции

Процедура ЗаполнитьМодульСоСтандартнымиОбластями(СтрМодуль, СтрНовыйМодуль) Экспорт
	ОбработкаРасстановкиОбластей().ЗаполнитьМодульСоСтандартнымиОбластями(СтрМодуль, СтрНовыйМодуль);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработкаРасстановкиОбластей()
	Возврат Обработки.ОМ_Компонент_РасстановкаОбластей.Создать();
КонецФункции

#КонецОбласти

