#Область ПрограммныйИнтерфейс

// Добавляет команды действий для управления областями модулей.
// 
// Параметры:
//  КомандыДействий - Объект - Объект для добавления новых команд действий.
Процедура ДобавитьКомандыДействий(КомандыДействий) Экспорт
	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Расстановка областей";
	НоваяСтрока.Идентификатор = "РасстановкаОбластей";
	НоваяСтрока.Порядок = 100;
	НоваяСтрока.СпособЗапускаДействия = "ВызовМетодаМодуляМенеджера";
	
	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Расстановка областей";
	НоваяСтрока.Идентификатор = "РасстановкаОбластейВыбранногоМодуля";
	НоваяСтрока.ОбластьДействия = "Модуль";
	НоваяСтрока.Порядок = 100;
	НоваяСтрока.СпособЗапускаДействия = "ВызовМетодаМодуляМенеджера";
КонецПроцедуры

// Выполняет действие по идентификатору команды, модифицируя дерево структуры модулей.
// 
// Параметры:
//  ИдКоманды        - Строка - Идентификатор выполняемой команды
//  ПараметрыКоманды - Объект - Объект, содержащий параметры команды
Процедура ВыполнитьДействие(ИдКоманды, ПараметрыКоманды) Экспорт
	Если ИдКоманды = "РасстановкаОбластей" Тогда
		ПараметрыКоманды.ДеревоСтруктурыМодулей = ДеревоСтруктурыМодулейСоСтандартнымиОбластями(ПараметрыКоманды.ДеревоСтруктурыМодулей);
	ИначеЕсли ИдКоманды = "РасстановкаОбластейВыбранногоМодуля" Тогда
		Для Индекс = 0 По ПараметрыКоманды.ДеревоСтруктурыМодулей.Строки.Количество() - 1 Цикл
			СтрокаДерева = ПараметрыКоманды.ДеревоСтруктурыМодулей.Строки[Индекс];
			Если СтрокаДерева.Выбрана Тогда
				НоваяСтрока = ПараметрыКоманды.ДеревоСтруктурыМодулей.Строки.Вставить(Индекс);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
	
				ЗаполнитьМодульСоСтандартнымиОбластями(СтрокаДерева, НоваяСтрока);
				
				ПараметрыКоманды.ДеревоСтруктурыМодулей.Строки.Удалить(Индекс + 1);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Возвращает дерево структуры модулей с добавлением стандартных областей
// 
// Параметры:
//  ДеревоСтруктуры - Дерево - Исходное дерево структуры модулей
// 
// Возвращаемое значение:
//  Дерево - Дерево структуры модулей со стандартными областями
Функция ДеревоСтруктурыМодулейСоСтандартнымиОбластями(ДеревоСтруктуры) Экспорт
	Возврат ОбработкаРасстановкиОбластей().ДеревоСтруктурыМодулейСоСтандартнымиОбластями(ДеревоСтруктуры);
КонецФункции

// Заполняет модуль стандартными областями
// 
// Параметры:
//  СтрМодуль      - Неизвестно - Исходная строка модуля
//  СтрНовыйМодуль - Неизвестно - Новая строка с стандартными областями
Процедура ЗаполнитьМодульСоСтандартнымиОбластями(СтрМодуль, СтрНовыйМодуль) Экспорт
	ОбработкаРасстановкиОбластей().ЗаполнитьМодульСоСтандартнымиОбластями(СтрМодуль, СтрНовыйМодуль);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработкаРасстановкиОбластей()
	Возврат Обработки.ОМ_Компонент_РасстановкаОбластей.Создать();
КонецФункции

#КонецОбласти

