#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыДействий(КомандыДействий) Экспорт
	НоваяСтрока = КомандыДействий.Добавить();
	НоваяСтрока.Представление = "Документирование методов (с настройкой)...";
	НоваяСтрока.Идентификатор = "ДокументированиеВыбранногоМетодаСНастройкой";
	НоваяСтрока.ОбластьДействия = "Процедура,Функция,Модуль,Область";
	НоваяСтрока.Порядок = 201;
	НоваяСтрока.СпособЗапускаДействия = "ОткрытиеФормы";
	
	//НоваяСтрока = КомандыДействий.Добавить();
	//НоваяСтрока.Представление = "Документирование";
	//НоваяСтрока.Идентификатор = "ДокументированиеВыбранногоМетода";
	//НоваяСтрока.ОбластьДействия = "Процедура,Функция";
	//НоваяСтрока.Порядок = 200;
	//НоваяСтрока.СпособЗапускаДействия = "ВызовМетодаМодуляМенеджера";
КонецПроцедуры

#КонецОбласти

