#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПараметрыКоманды") Тогда
		дз = ПолучитьИзВременногоХранилища(Параметры.ПараметрыКоманды.АдресДереваСтруктурыМодулей);
		
		СоответствиеТекстовМодулей = Обработки.ОМ_Компонент_ГенерацияТекстовМодулей.СоответствиеТекстыМодулей(дз);
	
		Для каждого КлючЗначение Из СоответствиеТекстовМодулей Цикл
			СтрМодули = Модули.Добавить();
			СтрМодули.Имя = КлючЗначение.Ключ.Описание;
			СтрМодули.Текст = КлючЗначение.Значение;
		КонецЦикла;
	Иначе
		ВызватьИсключение "В форму должен быть передан параметр ДеревоСтруктурыМодулей";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

